Reports/ПосещенияГант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>ПосещенияГант</Name>
		</Properties>
	</Report>
</MetaDataObject>

Catalogs/ПосещенияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ПосещенияКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметПосещения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПосещения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточнение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УточнениеПредметаПосещения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаРабочегоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПосещенияКонтрагентовПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ПосещенияГант/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьПосещения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПосещенияКонтрагентов.Ссылка,
		|	ПосещенияКонтрагентов.Подразделение,
		|	ПосещенияКонтрагентов.Контрагент,
		|	ПосещенияКонтрагентов.ПредметПосещения,
		|	ПосещенияКонтрагентов.Уточнение,
		|	ПосещенияКонтрагентов.ФизическоеЛицо,
		|	ПосещенияКонтрагентов.Дата,
		|	ПосещенияКонтрагентов.Отработано,
		|	ПосещенияКонтрагентов.Количество,
		|	ПосещенияКонтрагентов.Часов,
		|	ПосещенияКонтрагентов.Цвет,
		|	ПосещенияКонтрагентов.Расходы
		|ИЗ
		|	Справочник.ПосещенияКонтрагентов КАК ПосещенияКонтрагентов
		|ГДЕ
		|	(&ВсеКонтрагенты
		|			ИЛИ ПосещенияКонтрагентов.Контрагент = &Контрагент)
		|	И (&ВсеПредметыПосещения
		|			ИЛИ ПосещенияКонтрагентов.ПредметПосещения = &ПредметПосещения)
		|	И (&ВсеУточнения
		|			ИЛИ ПосещенияКонтрагентов.Уточнение = &Уточнение)
		|	И НЕ ПосещенияКонтрагентов.ПометкаУдаления
		|	И ПосещенияКонтрагентов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И (&ВсеПодразделения
		|			ИЛИ ПосещенияКонтрагентов.Подразделение = &Подразделение)";
	
	
	//
	Запрос.УстановитьПараметр("ДатаНачала", 			Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 			Период.ДатаОкончания);
	//	
	Запрос.УстановитьПараметр("ВсеКонтрагенты", 		НЕ ЗначениеЗаполнено( Контрагент ));
	Запрос.УстановитьПараметр("ВсеПредметыПосещения", 	НЕ ЗначениеЗаполнено( ПредметПосещения ));
	Запрос.УстановитьПараметр("ВсеУточнения", 			НЕ ЗначениеЗаполнено( Уточнение ));
	Запрос.УстановитьПараметр("ВсеПодразделения", 		НЕ ЗначениеЗаполнено( Подразделение ));
	//
	Запрос.УстановитьПараметр("Контрагент", 			Контрагент);
	Запрос.УстановитьПараметр("ПредметПосещения", 		ПредметПосещения);
	Запрос.УстановитьПараметр("Уточнение", 				Уточнение);
	Запрос.УстановитьПараметр("Подразделение", 			Подразделение);
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
КонецФункции

&НаСервере
Процедура НастройкаДиаграммыГанта( ДиаграммаГанта )
	ДиаграммаГанта.Очистить();
	ДиаграммаГанта.ОтображатьЗаголовок 				= Ложь;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала 	= Ложь;
	
	ДиаграммаГанта.УстановитьПолныйИнтервал(Период.ДатаНачала, Период.ДатаОкончания);

	//
	ДиаграммаГанта.ЕдиницаПериодическогоВарианта 	= ТипЕдиницыШкалыВремени.Месяц;
	ДиаграммаГанта.КратностьПериодическогоВарианта	= 1;
	
	// две шкалы времени - день и месяц
	Если ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Количество() = 1 Тогда
		ШкалаМесяц 				= ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		ШкалаМесяц.Единица   	= ТипЕдиницыШкалыВремени.Месяц;
		ШкалаМесяц.Кратность 	= 1;
		ШкалаМесяц.ФорматДня	= ФорматДняШкалыВремени.ДеньМесяца;
		
		// чтобы была верхней
		ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Сдвинуть( ШкалаМесяц, -1);
	КонецЕсли;	
	
	//
	ДиаграммаГанта.ПоддержкаМасштаба			= ПоддержкаМасштабаДиаграммыГанта.Авто;
	ДиаграммаГанта.ОтображениеИнтервала			= ОтображениеИнтервалаДиаграммыГанта.Плоский;
	ДиаграммаГанта.ОтображениеТекстаЗначения 	= ОтображениеТекстаЗначенияДиаграммыГанта.Право;
	ДиаграммаГанта.ОтображатьЛегенду			= Ложь;
	ДиаграммаГанта.ОбластьПостроения.Право		= 1;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьГантаПоПосещениям(Посещения, ПолеГруппировки)
	сПосещения = Новый Структура;
	// состав 
	// состав структуры - массивы
	//мСерии 		= Новый Массив;
	//мГруппы 	= Новый Массив;
	мПосещения 	= Новый Массив;
	
	Для Каждого Посещение ИЗ Посещения Цикл
		Цвет	= УП_РаботаСРабочимКалендаремСервер.ПолучитьЦветТабличногоДокумента( Посещение.Цвет);
		// серии отработано - не отработано
		//Если мСерии.Найти( Посещение.Отработано ) = Неопределено Тогда
		//	сСерия = Новый Структура;
		//	сСерия.Вставить("Значение", 		Посещение.Отработано );

		//	сСерия.Вставить("Цвет", 			Цвет );
		//	сСерия.Вставить("Текст", 			Посещение.Отработано );
		//	
		//	мСерии.Добавить(сСерия);
		//КонецЕсли;
		//Если мГруппы.Найти( Посещение[ПолеГруппировки] ) = Неопределено Тогда
		//	мГруппы.Добавить(Посещение[ПолеГруппировки]);
		//КОнецЕсли;
		
		сОт = Новый Структура("Ссылка,Подразделение,Контрагент,ПредметПосещения,Уточнение,ФизическоеЛицо,Дата,"+ 
							  "Отработано,Количество,Часов,Расходы,Цвет");
		
		ЗаполнитьЗначенияСвойств( сОт, Посещение,,"Цвет" );
		
		Если Посещение.Отработано Тогда
			сОт.Цвет = WebЦвета.ЦианТемный;
		Иначе
			сОт.Цвет = Цвет;
		КонецЕсли;
		
		// 
		мПосещения.Добавить( сОт );
	КонецЦикла;
	//сПосещения.Вставить("Серии", 	мСерии );
	//сПосещения.Вставить("Группы", 	мГруппы );
	сПосещения.Вставить("Точки", 	мПосещения );
	Возврат сПосещения;
	
	
КонецФункции

&НаСервере
Функция ДобавитьИнтервал( ЗначениеДГ, Значение, Начало, Конец, Цвет, Текст )
	Интервал = ЗначениеДГ.Добавить();
	Интервал.Начало 		= Начало;
	Интервал.Конец  		= Конец;
	Интервал.Расшифровка 	= Значение;
	Интервал.Цвет			= Цвет;
	// срок отсутствия
	Интервал.Текст			= "" + Текст + ", " + Формат(Начало,"ДЛФ=D" ) + "-" + Формат(Конец, "ДЛФ=D");
	Возврат Интервал;
КонецФункции

&НаСервереБезКонтекста
Функция МассивНеРабочихДней( НачалоПолногоИнтервала, КонецПолногоИнтервала )
	Возврат УП_РаботыСервер.МассивНеРабочихДней( НачалоПолногоИнтервала, КонецПолногоИнтервала );
КонецФункции

//&НаСервере
//Процедура СформироватьДиаграммуПоПосещениям( ПосещенияДГ )
//	Посещения 	= ПолучитьПосещения();
//	// сгруппируем пока только по предметам посещений
//	ПолеГруппировки = "ПредметПосещения";
//	Посещения.Сортировать(ПолеГруппировки+ ",Дата");

//	сПосещения 		= ПолучитьГантаПоПосещениям(Посещения, ПолеГруппировки);
//	Серия			= ПосещенияДГ.Серии.Добавить();
//	
//	Для Каждого Посещение ИЗ сПосещения.Точки Цикл
//		ТочкаГруппа			= ПосещенияДГ.УстановитьТочку( Посещение[ПолеГруппировки] );
//		//ЗначениеГруппы     	= ПосещенияДГ.ПолучитьЗначение( ТочкаГруппа, Серия );
//		//
//		// само посещение
//		Точка				= ПосещенияДГ.УстановитьТочку( Посещение.ФизическоеЛицо, Посещение[ПолеГруппировки] );
//		//Точка				= ПосещенияДГ.УстановитьТочку( Посещение.ФизическоеЛицо, ТочкаГруппа );
//		Точка.Текст 		= Посещение.ФизическоеЛицо;
//		ЗначениеДГ  		= ПосещенияДГ.ПолучитьЗначение( Точка, Серия );
//		//
//		
//		Интервал 			= ДобавитьИнтервал( ЗначениеДГ, 
//								Посещение.Ссылка,
//								НачалоЧаса( Посещение.Дата), 
//								КонецЧаса( Посещение.Дата+ Посещение.Часов * 60 * 60), 
//								Посещение.Цвет,
//								Посещение.Уточнение);   
//		
//	КонецЦикла;
//	
//	// отрисовываем выходные дни
//	ПосещенияДГ.ИнтервалыФона.Очистить();
//	ДниСхемыРабот = МассивНеРабочихДней( ПосещенияДГ.НачалоПолногоИнтервала,  ПосещенияДГ.КонецПолногоИнтервала);
//	Для Каждого День ИЗ ДниСхемыРабот Цикл
//		Выходной = ПосещенияДГ.ИнтервалыФона.Добавить(НачалоДня(День), КонецДня(День));
//		// 
//		Выходной.Цвет = WebЦвета.СветлоСерый;
//		
//	КонецЦикла;
//	
//КонецПроцедуры


// одно физ лицо не может быть выведено в несколько групп, т.е может быть только верхней группировкой
&НаСервере
Процедура СформироватьДиаграммуПоПосещениям( ПосещенияДГ )
	Посещения 	= ПолучитьПосещения();
	// сгруппируем пока только по предметам посещений
	ПолеГруппировки = "ПредметПосещения";
	Посещения.Сортировать("Контрагент," + ПолеГруппировки+ ",ФизическоеЛицо,Дата");

	сПосещения 		= ПолучитьГантаПоПосещениям(Посещения, ПолеГруппировки);
	Серия			= ПосещенияДГ.Серии.Добавить();
	
	Для Каждого Посещение ИЗ сПосещения.Точки Цикл
		ТочкаКонтрагент		= ПосещенияДГ.УстановитьТочку( Посещение.Контрагент );
		//  группа
		ЗначениеГруппы 		= "" + Посещение.Контрагент +  Посещение[ПолеГруппировки];
		ТочкаГруппа			= ПосещенияДГ.УстановитьТочку( ЗначениеГруппы, Посещение.Контрагент );
		ТочкаГруппа.Текст   = Посещение[ПолеГруппировки];
		
		// точка
		ЗначениеТочки  		= "" + Посещение.Контрагент + Посещение.ПредметПосещения + Посещение.ФизическоеЛицо;
		
		Точка				= ПосещенияДГ.УстановитьТочку( ЗначениеТочки, ЗначениеГруппы );
		Точка.Текст 		= Посещение.ФизическоеЛицо;
		ЗначениеДГ  		= ПосещенияДГ.ПолучитьЗначение( Точка, Серия );
		//
		
		Интервал 			= ДобавитьИнтервал( ЗначениеДГ, 
								Посещение.Ссылка,
								НачалоЧаса( Посещение.Дата), 
								КонецЧаса( Посещение.Дата+ Посещение.Часов * 60 * 60), 
								Посещение.Цвет,
								Посещение.Уточнение);   
		
	КонецЦикла;
	
	// отрисовываем выходные дни
	ПосещенияДГ.ИнтервалыФона.Очистить();
	ДниСхемыРабот = МассивНеРабочихДней( ПосещенияДГ.НачалоПолногоИнтервала,  ПосещенияДГ.КонецПолногоИнтервала);
	Для Каждого День ИЗ ДниСхемыРабот Цикл
		Выходной = ПосещенияДГ.ИнтервалыФона.Добавить(НачалоДня(День), КонецДня(День));
		// 
		Выходной.Цвет = WebЦвета.СветлоСерый;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	НастройкаДиаграммыГанта( ПосещенияДГ );
	
	СформироватьДиаграммуПоПосещениям( ПосещенияДГ );
	ПосещенияДГ.ПоказатьУровеньТочек(0);
	ПосещенияДГ.Обновление 						= Истина;
	
	
КонецПроцедуры
